src/data_analysis/collected_data/orange/api/standarda8v2/a/load_read.txt
Running 30m test @ http://20.108.167.175:60/wrk2-api/home-timeline/read
  2 threads and 1000 connections
  Thread calibration: mean lat.: 604.049ms, rate sampling interval: 3344ms
  Thread calibration: mean lat.: 577.808ms, rate sampling interval: 3256ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    10.98m     6.46m   22.19m    57.90%
    Req/Sec   126.41     11.91   155.00     79.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.93m 
 75.000%   16.52m 
 90.000%   20.01m 
 99.000%   22.19m 
 99.900%   22.89m 
 99.990%   23.44m 
 99.999%   23.59m 
100.000%   23.72m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     358.655     0.000000            1         1.00
  125042.687     0.100000        45418         1.11
  257818.623     0.200000        90850         1.25
  390070.271     0.300000       136273         1.43
  521928.703     0.400000       181731         1.67
  655884.287     0.500000       227166         2.00
  721420.287     0.550000       249816         2.22
  788529.151     0.600000       272584         2.50
  856162.303     0.650000       295290         2.86
  923795.455     0.700000       318022         3.33
  991428.607     0.750000       340754         4.00
 1026555.903     0.775000       352101         4.44
 1061158.911     0.800000       363398         5.00
 1096810.495     0.825000       374957         5.71
 1131413.503     0.850000       386344         6.67
 1164967.935     0.875000       397404         8.00
 1182793.727     0.887500       403114         8.89
 1200619.519     0.900000       408996        10.00
 1217396.735     0.912500       414629        11.43
 1234173.951     0.925000       420241        13.33
 1250951.167     0.937500       425943        16.00
 1259339.775     0.943750       428663        17.78
 1268776.959     0.950000       431762        20.00
 1277165.567     0.956250       434529        22.86
 1286602.751     0.962500       437457        26.67
 1294991.359     0.968750       440118        32.00
 1300234.239     0.971875       441627        35.56
 1304428.543     0.975000       442938        40.00
 1309671.423     0.978125       444424        45.71
 1313865.727     0.981250       445681        53.33
 1320157.183     0.984375       447209        64.00
 1323302.911     0.985938       447958        71.11
 1326448.639     0.987500       448639        80.00
 1329594.367     0.989062       449185        91.43
 1333788.671     0.990625       450051       106.67
 1337982.975     0.992188       450704       128.00
 1340080.127     0.992969       451000       142.22
 1343225.855     0.993750       451389       160.00
 1346371.583     0.994531       451772       182.86
 1348468.735     0.995313       452022       213.33
 1352663.039     0.996094       452412       256.00
 1354760.191     0.996484       452582       284.44
 1356857.343     0.996875       452763       320.00
 1358954.495     0.997266       452920       365.71
 1362100.223     0.997656       453107       426.67
 1365245.951     0.998047       453297       512.00
 1366294.527     0.998242       453347       568.89
 1368391.679     0.998437       453461       640.00
 1370488.831     0.998633       453542       731.43
 1372585.983     0.998828       453640       853.33
 1374683.135     0.999023       453719      1024.00
 1375731.711     0.999121       453753      1137.78
 1377828.863     0.999219       453809      1280.00
 1379926.015     0.999316       453843      1462.86
 1382023.167     0.999414       453894      1706.67
 1384120.319     0.999512       453923      2048.00
 1385168.895     0.999561       453939      2275.56
 1387266.047     0.999609       453971      2560.00
 1389363.199     0.999658       453988      2925.71
 1392508.927     0.999707       454013      3413.33
 1395654.655     0.999756       454029      4096.00
 1397751.807     0.999780       454049      4551.11
 1398800.383     0.999805       454061      5120.00
 1398800.383     0.999829       454061      5851.43
 1399848.959     0.999854       454073      6826.67
 1401946.111     0.999878       454084      8192.00
 1402994.687     0.999890       454090      9102.22
 1406140.415     0.999902       454095     10240.00
 1408237.567     0.999915       454101     11702.86
 1409286.143     0.999927       454105     13653.33
 1410334.719     0.999939       454111     16384.00
 1411383.295     0.999945       454117     18204.44
 1411383.295     0.999951       454117     20480.00
 1412431.871     0.999957       454123     23405.71
 1412431.871     0.999963       454123     27306.67
 1413480.447     0.999969       454127     32768.00
 1413480.447     0.999973       454127     36408.89
 1413480.447     0.999976       454127     40960.00
 1414529.023     0.999979       454129     46811.43
 1415577.599     0.999982       454133     54613.33
 1415577.599     0.999985       454133     65536.00
 1415577.599     0.999986       454133     72817.78
 1415577.599     0.999988       454133     81920.00
 1417674.751     0.999989       454134     93622.86
 1417674.751     0.999991       454134    109226.67
 1420820.479     0.999992       454135    131072.00
 1420820.479     0.999993       454135    145635.56
 1422917.631     0.999994       454138    163840.00
 1422917.631     1.000000       454138          inf
#[Mean    =   658936.254, StdDeviation   =   387504.617]
#[Max     =  1421869.056, Total count    =       454138]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  461163 requests in 30.00m, 6.11GB read
  Socket errors: connect 0, read 10265, write 17318, timeout 121486
  Non-2xx or 3xx responses: 167
Requests/sec:    256.20
Transfer/sec:      3.47MB